START_MESSAGE = (
    "<b>👋 Добро пожаловать в бот для изучения китайского языка!</b>\n\n"
    "Здесь вы можете приобрести и пройти уроки по китайскому языку, которые помогут вам освоить:\n"
    "- Основы китайского языка;\n"
    "- Произношение и фонетику;\n"
    "- Грамматику и синтаксис;\n"
    "- Расширение словарного запаса;\n"
    "- Навыки разговорного китайского.\n\n"
    "<b>Что вы можете сделать в этом боте:</b>\n"
    "- Просмотреть доступные уроки и их описание;\n"
    "- Приобрести уроки по интересующим темам;\n"
    "- Получить доступ к ранее купленным урокам.\n\n"
    "<b>🌟 Начните свой путь к изучению китайского языка прямо сейчас!</b>"
)

HELP_MESSAGE = (
    "<b>🛠 Помощь по использованию бота:</b>\n\n"
    "<b>Доступные команды:</b>\n\n"
    "<b>1. /lessons</b> - Просмотреть список доступных уроков по китайскому языку.\n"
    "<b>1. /lessons</b> - Просмотреть список доступных уроков по китайскому языку.\n"
    "<b>1. /lessons</b> - Просмотреть список доступных уроков по китайскому языку.\n"
    "<b>🌟 Советы по использованию бота:</b>\n"
    "- Используйте команду /lessons, чтобы узнать больше о каждом уроке."
)

LESSONS_MESSAGE = (
    "<b>📚 Выберите урок из списка:</b>\n\n"
    "Нажмите на интересующий вас урок, чтобы узнать подробнее и приобрести его:\n"
)

LESSON_DETAILS_MESSAGE = (
    "<b>📘 Урок: {name}</b>\n\n"
    "<b>Описание:</b> {description}\n\n"
    "<b>💰 Стоимость:</b> {price} руб.\n\n"
    "<b>👉 Готовы приобрести? Нажмите на кнопку ниже!</b>\n"
)
