from aiogram.utils import markdown


START_MESSAGE = (
    markdown.bold("🫡 Здравия желаю!\n") + "\n"
    "Перечень моих возможностей:\n"
    "\- Создание интерактивной карты;\n"
    "\- Создание тематической интерактивной карты;\n"
    "\- Создание общей информационно\-новостной сводки;\n"
    "\- Создание краткой информационно\-новостной сводки по населенному пункту;\n"
    "\- Создание информационно\-отчетных документов\.\n"
    "\n"
    + markdown.bold("GeOSINT Service к Вашим услугам...")
    + "\n\n"
    + markdown.bold("❓ По вопросам работы бота и (или) сотрудничества: @Chief_train\n")
)


HELP_MESSAGE = (
    markdown.bold("GeOSINT Service работает в нескольких режимах:\n")
    + "\n"
    + markdown.bold("1. Режим создания интерактивной карты:\n")
    + "Бот получает границы временного интервала и создает интерактивную карту\.\n"
    + markdown.bold("Команда: /map\n")
    + "\n"
    + markdown.bold("2. Режим создания тематической интерактивной карты:\n")
    + "Бот получает границы временного интервала и ключевое слово, затем создает интерактивную карту по ключевому слову и семантически близким к нему\.\n"
    + markdown.bold("Команда: /tag_map\n")
    + "\n"
    + markdown.bold("3. Режим создания общей информационно-новостной сводки:\n")
    + "Бот получает границы временного интервала и создает краткую информационно\-новостную сводку\.\n"
    + markdown.bold("Команда: /fast_summary\n")
    + "\n"
    + markdown.bold(
        "4. Режим создания краткой новостной сводки по населенному пункту:\n"
    )
    + "Бот получает границы временного интервала и название насенного пункта, затем создает краткую информационно\-новостную сводку по выбранному населенному пункту\.\n"
    + markdown.bold("Команда: /city_summary\n")
    + "\n"
    + markdown.bold("5. Режим создания информационно-отчетного документа:\n")
    + "Бот получает границы временного интервала создает информационно\-отчетный документ\.\n"
    + markdown.bold("Команда: /report\n")
    + "\n"
    + markdown.bold("GeOSINT Service к Вашим услугам...")
    + "\n\n"
    + markdown.bold("❓ По вопросам работы бота и (или) сотрудничества: @Chief_train\n")
)
